In [46]:
# Import Modules
import pandas as pd
import matplotlib.pyplot as plt

In [47]:
data = pd.read_excel('/Users/talhajamal/Desktop/Code/Regression_Analysis/data/data_coursework_Q1.xls')
data.head()

,Unnamed: 0,year_,month_,date_,1-month Tbill,Unnamed: 5,SP500,IBM,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Note: the 1-month T-bill is multiplied,Unnamed: 13,Unnamed: 14
0,NaN,1960,1,JAN 1960,0.33,NaN,58.03,adjusted,,by 100,and is,not,expressed,in yearly,basis
1,NaN,1960,2,FEB 1960,0.29,NaN,55.78,closed,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,1960,3,MAR 1960,0.35,NaN,55.02,pirce,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,1960,4,APR 1960,0.19,NaN,55.73,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,1960,5,MAY 1960,0.27,NaN,55.22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
# Drop certain columns and rows
data = data.iloc[3:, 0:8]
data.drop(['Unnamed: 0', 'Unnamed: 5'], axis=1, inplace=True)
data.columns = ['Year', 'Month', 'Date', '1M T-bill', 'SP500', 'IBM']
data = data[['Date', 'Year', 'Month', '1M T-bill', 'SP500', 'IBM']]
data.dropna(inplace=True)
data.reset_index()

     index      Date  Year  Month  1M T-bill   SP500    IBM
0       24  JAN 1962  1962      1       0.24   69.07   2.69
1       25  FEB 1962  1962      2       0.20   70.22   2.66
2       26  MAR 1962  1962      3       0.20   70.29   2.64
3       27  APR 1962  1962      4       0.22   68.05   2.25
4       28  MAY 1962  1962      5       0.24   62.99   1.95
..     ...       ...   ...    ...        ...     ...    ...
343    367  AUG 1990  1990      8       0.66  330.70  19.89
344    368  SEP 1990  1990      9       0.60  315.40  20.77
345    369  OCT 1990  1990     10       0.68  307.10   20.6
346    370  NOV 1990  1990     11       0.57  315.20  22.43
347    371  DEC 1990  1990     12       0.60  328.70  22.31

[348 rows x 7 columns]